morozanime/stm8_4_eclipse/iostm8s208mb.h
/* TIM1 status register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 1;
  unsigned char CC1OF       : 1;
  unsigned char CC2OF       : 1;
  unsigned char CC3OF       : 1;
  unsigned char CC4OF       : 1;
} __BITS_TIM1_SR2;
#endif
//__IO_REG8_BIT(TIM1_SR2,    0x5256, __READ_WRITE, __BITS_TIM1_SR2);
unsigned char TIM1_SR2; //0x5256 __READ_WRITE
__BITS_TIM1_SR2 TIM1_SR2_bit;

/* TIM1 event generation register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UG          : 1;
  unsigned char CC1G        : 1;
  unsigned char CC2G        : 1;
  unsigned char CC3G        : 1;
  unsigned char CC4G        : 1;
  unsigned char COMG        : 1;
  unsigned char TG          : 1;
  unsigned char BG          : 1;
} __BITS_TIM1_EGR;
#endif
//__IO_REG8_BIT(TIM1_EGR,    0x5257, __WRITE, __BITS_TIM1_EGR);
unsigned char TIM1_EGR; //0x5257 __WRITE
__BITS_TIM1_EGR TIM1_EGR_bit;

/* TIM1 capture/compare mode register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC1S        : 2;
  unsigned char OC1FE       : 1;
  unsigned char OC1PE       : 1;
  unsigned char OC1M        : 3;
  unsigned char OC1CE       : 1;
} __BITS_TIM1_CCMR1;
#endif
//__IO_REG8_BIT(TIM1_CCMR1,  0x5258, __READ_WRITE, __BITS_TIM1_CCMR1);
unsigned char TIM1_CCMR1; //0x5258 __READ_WRITE
__BITS_TIM1_CCMR1 TIM1_CCMR1_bit;

/* TIM1 capture/compare mode register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC2S        : 2;
  unsigned char OC2FE       : 1;
  unsigned char OC2PE       : 1;
  unsigned char OC2M        : 3;
  unsigned char OC2CE       : 1;
} __BITS_TIM1_CCMR2;
#endif
//__IO_REG8_BIT(TIM1_CCMR2,  0x5259, __READ_WRITE, __BITS_TIM1_CCMR2);
unsigned char TIM1_CCMR2; //0x5259 __READ_WRITE
__BITS_TIM1_CCMR2 TIM1_CCMR2_bit;

/* TIM1 capture/compare mode register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC3S        : 2;
  unsigned char OC3FE       : 1;
  unsigned char OC3PE       : 1;
  unsigned char OC3M        : 3;
  unsigned char OC3CE       : 1;
} __BITS_TIM1_CCMR3;
#endif
//__IO_REG8_BIT(TIM1_CCMR3,  0x525A, __READ_WRITE, __BITS_TIM1_CCMR3);
unsigned char TIM1_CCMR3; //0x525A __READ_WRITE
__BITS_TIM1_CCMR3 TIM1_CCMR3_bit;

/* TIM1 capture/compare mode register 4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC4S        : 2;
  unsigned char OC4FE       : 1;
  unsigned char OC4PE       : 1;
  unsigned char OC4M        : 3;
  unsigned char OC4CE       : 1;
} __BITS_TIM1_CCMR4;
#endif
//__IO_REG8_BIT(TIM1_CCMR4,  0x525B, __READ_WRITE, __BITS_TIM1_CCMR4);
unsigned char TIM1_CCMR4; //0x525B __READ_WRITE
__BITS_TIM1_CCMR4 TIM1_CCMR4_bit;

/* TIM1 capture/compare enable register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC1E        : 1;
  unsigned char CC1P        : 1;
  unsigned char CC1NE       : 1;
  unsigned char CC1NP       : 1;
  unsigned char CC2E        : 1;
  unsigned char CC2P        : 1;
  unsigned char CC2NE       : 1;
  unsigned char CC2NP       : 1;
} __BITS_TIM1_CCER1;
#endif
//__IO_REG8_BIT(TIM1_CCER1,  0x525C, __READ_WRITE, __BITS_TIM1_CCER1);
unsigned char TIM1_CCER1; //0x525C __READ_WRITE
__BITS_TIM1_CCER1 TIM1_CCER1_bit;

/* TIM1 capture/compare enable register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC3E        : 1;
  unsigned char CC3P        : 1;
  unsigned char CC3NE       : 1;
  unsigned char CC3NP       : 1;
  unsigned char CC4E        : 1;
  unsigned char CC4P        : 1;
} __BITS_TIM1_CCER2;
#endif
//__IO_REG8_BIT(TIM1_CCER2,  0x525D, __READ_WRITE, __BITS_TIM1_CCER2);
unsigned char TIM1_CCER2; //0x525D __READ_WRITE
__BITS_TIM1_CCER2 TIM1_CCER2_bit;

/* TIM1 counter high */
//__IO_REG8    (TIM1_CNTRH,  0x525E, __READ_WRITE);
unsigned char TIM1_CNTRH; //0x525E __READ_WRITE
/* TIM1 counter low */
//__IO_REG8    (TIM1_CNTRL,  0x525F, __READ_WRITE);
unsigned char TIM1_CNTRL; //0x525F __READ_WRITE
/* TIM1 prescaler register high */
//__IO_REG8    (TIM1_PSCRH,  0x5260, __READ_WRITE);
unsigned char TIM1_PSCRH; //0x5260 __READ_WRITE
/* TIM1 prescaler register low */
//__IO_REG8    (TIM1_PSCRL,  0x5261, __READ_WRITE);
unsigned char TIM1_PSCRL; //0x5261 __READ_WRITE
/* TIM1 auto-reload register high */
//__IO_REG8    (TIM1_ARRH,   0x5262, __READ_WRITE);
unsigned char TIM1_ARRH; //0x5262 __READ_WRITE
/* TIM1 auto-reload register low */
//__IO_REG8    (TIM1_ARRL,   0x5263, __READ_WRITE);
unsigned char TIM1_ARRL; //0x5263 __READ_WRITE
/* TIM1 repetition counter register */
//__IO_REG8    (TIM1_RCR,    0x5264, __READ_WRITE);
unsigned char TIM1_RCR; //0x5264 __READ_WRITE
/* TIM1 capture/compare register 1 high */
//__IO_REG8    (TIM1_CCR1H,  0x5265, __READ_WRITE);
unsigned char TIM1_CCR1H; //0x5265 __READ_WRITE
/* TIM1 capture/compare register 1 low */
//__IO_REG8    (TIM1_CCR1L,  0x5266, __READ_WRITE);
unsigned char TIM1_CCR1L; //0x5266 __READ_WRITE
/* TIM1 capture/compare register 2 high */
//__IO_REG8    (TIM1_CCR2H,  0x5267, __READ_WRITE);
unsigned char TIM1_CCR2H; //0x5267 __READ_WRITE
/* TIM1 capture/compare register 2 low */
//__IO_REG8    (TIM1_CCR2L,  0x5268, __READ_WRITE);
unsigned char TIM1_CCR2L; //0x5268 __READ_WRITE
/* TIM1 capture/compare register 3 high */
//__IO_REG8    (TIM1_CCR3H,  0x5269, __READ_WRITE);
unsigned char TIM1_CCR3H; //0x5269 __READ_WRITE
/* TIM1 capture/compare register 3 low */
//__IO_REG8    (TIM1_CCR3L,  0x526A, __READ_WRITE);
unsigned char TIM1_CCR3L; //0x526A __READ_WRITE
/* TIM1 capture/compare register 4 high */
//__IO_REG8    (TIM1_CCR4H,  0x526B, __READ_WRITE);
unsigned char TIM1_CCR4H; //0x526B __READ_WRITE
/* TIM1 capture/compare register 4 low */
//__IO_REG8    (TIM1_CCR4L,  0x526C, __READ_WRITE);
unsigned char TIM1_CCR4L; //0x526C __READ_WRITE
/* TIM1 break register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LOCK        : 2;
  unsigned char OSSI        : 1;
  unsigned char OSSR        : 1;
  unsigned char BKE         : 1;
  unsigned char BKP         : 1;
  unsigned char AOE         : 1;
  unsigned char MOE         : 1;
} __BITS_TIM1_BKR;
#endif
//__IO_REG8_BIT(TIM1_BKR,    0x526D, __READ_WRITE, __BITS_TIM1_BKR);
unsigned char TIM1_BKR; //0x526D __READ_WRITE
__BITS_TIM1_BKR TIM1_BKR_bit;

/* TIM1 dead-time register */
//__IO_REG8    (TIM1_DTR,    0x526E, __READ_WRITE);
unsigned char TIM1_DTR; //0x526E __READ_WRITE
/* TIM1 output idle state register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char OIS1        : 1;
  unsigned char OIS1N       : 1;
  unsigned char OIS2        : 1;
  unsigned char OIS2N       : 1;
  unsigned char OIS3        : 1;
  unsigned char OIS3N       : 1;
  unsigned char OIS4        : 1;
} __BITS_TIM1_OISR;
#endif
//__IO_REG8_BIT(TIM1_OISR,   0x526F, __READ_WRITE, __BITS_TIM1_OISR);
unsigned char TIM1_OISR; //0x526F __READ_WRITE
__BITS_TIM1_OISR TIM1_OISR_bit;


/*-------------------------------------------------------------------------
 *      TIM1 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define TIM1_CR1_CEN             TIM1_CR1_bit.CEN
#define TIM1_CR1_UDIS            TIM1_CR1_bit.UDIS
#define TIM1_CR1_URS             TIM1_CR1_bit.URS
#define TIM1_CR1_OPM             TIM1_CR1_bit.OPM
#define TIM1_CR1_DIR             TIM1_CR1_bit.DIR
#define TIM1_CR1_CMS             TIM1_CR1_bit.CMS
#define TIM1_CR1_ARPE            TIM1_CR1_bit.ARPE

#define TIM1_CR2_CCPG            TIM1_CR2_bit.CCPG
#define TIM1_CR2_COMS            TIM1_CR2_bit.COMS
#define TIM1_CR2_MMS             TIM1_CR2_bit.MMS

