morozanime/stm8_4_eclipse/iostm8s208mb.h
#define TIM4_IER_UIE             TIM4_IER_bit.UIE
#define TIM4_IER_TIE             TIM4_IER_bit.TIE

#define TIM4_SR_UIF              TIM4_SR_bit.UIF
#define TIM4_SR_TIF              TIM4_SR_bit.TIF

#define TIM4_EGR_UG              TIM4_EGR_bit.UG
#define TIM4_EGR_TG              TIM4_EGR_bit.TG

#define TIM4_PSCR_PSC            TIM4_PSCR_bit.PSC

#endif

/*-------------------------------------------------------------------------
 *      TIM4 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_TIM4_CR1_CEN        0x01
#define MASK_TIM4_CR1_UDIS       0x02
#define MASK_TIM4_CR1_URS        0x04
#define MASK_TIM4_CR1_OPM        0x08
#define MASK_TIM4_CR1_ARPE       0x80

#define MASK_TIM4_IER_UIE        0x01
#define MASK_TIM4_IER_TIE        0x40

#define MASK_TIM4_SR_UIF         0x01
#define MASK_TIM4_SR_TIF         0x40

#define MASK_TIM4_EGR_UG         0x01
#define MASK_TIM4_EGR_TG         0x40

#define MASK_TIM4_PSCR_PSC       0x07


/*-------------------------------------------------------------------------
 *      ADC2 register definitions
 *-----------------------------------------------------------------------*/
/* ADC control/status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CH          : 4;
  unsigned char AWDIE       : 1;
  unsigned char EOCIE       : 1;
  unsigned char AWD         : 1;
  unsigned char EOC         : 1;
} __BITS_ADC_CSR;
#endif
//__IO_REG8_BIT(ADC_CSR,     0x5400, __READ_WRITE, __BITS_ADC_CSR);
unsigned char ADC_CSR; //0x5400 __READ_WRITE
__BITS_ADC_CSR ADC_CSR_bit;

/* ADC configuration register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ADON        : 1;
  unsigned char CONT        : 1;
  unsigned char             : 2;
  unsigned char SPSEL       : 3;
} __BITS_ADC_CR1;
#endif
//__IO_REG8_BIT(ADC_CR1,     0x5401, __READ_WRITE, __BITS_ADC_CR1);
unsigned char ADC_CR1; //0x5401 __READ_WRITE
__BITS_ADC_CR1 ADC_CR1_bit;

/* ADC configuration register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 1;
  unsigned char SCAN        : 1;
  unsigned char             : 1;
  unsigned char ALIGN       : 1;
  unsigned char EXTSEL      : 2;
  unsigned char EXTTRIG     : 1;
} __BITS_ADC_CR2;
#endif
//__IO_REG8_BIT(ADC_CR2,     0x5402, __READ_WRITE, __BITS_ADC_CR2);
unsigned char ADC_CR2; //0x5402 __READ_WRITE
__BITS_ADC_CR2 ADC_CR2_bit;

/* ADC configuration register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 6;
  unsigned char OVR         : 1;
  unsigned char DBUF        : 1;
} __BITS_ADC_CR3;
#endif
//__IO_REG8_BIT(ADC_CR3,     0x5403, __READ_WRITE, __BITS_ADC_CR3);
unsigned char ADC_CR3; //0x5403 __READ_WRITE
__BITS_ADC_CR3 ADC_CR3_bit;

/* ADC data register high */
//__IO_REG8    (ADC_DRH,     0x5404, __READ);
unsigned char ADC_DRH; //0x5404 __READ
/* ADC data register low */
//__IO_REG8    (ADC_DRL,     0x5405, __READ);
unsigned char ADC_DRL; //0x5405 __READ
/* ADC Schmitt trigger disable register high */
//__IO_REG8    (ADC_TDRH,    0x5406, __READ_WRITE);
unsigned char ADC_TDRH; //0x5406 __READ_WRITE
/* ADC Schmitt trigger disable register low */
//__IO_REG8    (ADC_TDRL,    0x5407, __READ_WRITE);
unsigned char ADC_TDRL; //0x5407 __READ_WRITE

/*-------------------------------------------------------------------------
 *      ADC2 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define ADC_CSR_CH               ADC_CSR_bit.CH
#define ADC_CSR_AWDIE            ADC_CSR_bit.AWDIE
#define ADC_CSR_EOCIE            ADC_CSR_bit.EOCIE
#define ADC_CSR_AWD              ADC_CSR_bit.AWD
#define ADC_CSR_EOC              ADC_CSR_bit.EOC

#define ADC_CR1_ADON             ADC_CR1_bit.ADON
#define ADC_CR1_CONT             ADC_CR1_bit.CONT
#define ADC_CR1_SPSEL            ADC_CR1_bit.SPSEL

#define ADC_CR2_SCAN             ADC_CR2_bit.SCAN
#define ADC_CR2_ALIGN            ADC_CR2_bit.ALIGN
#define ADC_CR2_EXTSEL           ADC_CR2_bit.EXTSEL
#define ADC_CR2_EXTTRIG          ADC_CR2_bit.EXTTRIG

#define ADC_CR3_OVR              ADC_CR3_bit.OVR
#define ADC_CR3_DBUF             ADC_CR3_bit.DBUF

#endif

/*-------------------------------------------------------------------------
 *      ADC2 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_ADC_CSR_CH          0x0F
#define MASK_ADC_CSR_AWDIE       0x10
#define MASK_ADC_CSR_EOCIE       0x20
#define MASK_ADC_CSR_AWD         0x40
#define MASK_ADC_CSR_EOC         0x80

#define MASK_ADC_CR1_ADON        0x01
#define MASK_ADC_CR1_CONT        0x02
#define MASK_ADC_CR1_SPSEL       0x70

#define MASK_ADC_CR2_SCAN        0x02
#define MASK_ADC_CR2_ALIGN       0x08
#define MASK_ADC_CR2_EXTSEL      0x30
#define MASK_ADC_CR2_EXTTRIG     0x40

#define MASK_ADC_CR3_OVR         0x40
#define MASK_ADC_CR3_DBUF        0x80


/*-------------------------------------------------------------------------
 *      beCAN register definitions
 *-----------------------------------------------------------------------*/
/* CAN master control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char INRQ        : 1;
  unsigned char SLEEP       : 1;
  unsigned char TXFP        : 1;
  unsigned char RFLM        : 1;
  unsigned char NART        : 1;
  unsigned char AWUM        : 1;
  unsigned char ABOM        : 1;
  unsigned char TTOM        : 1;
} __BITS_CAN_MCR;
#endif
//__IO_REG8_BIT(CAN_MCR,     0x5420, __READ_WRITE, __BITS_CAN_MCR);
unsigned char CAN_MCR; //0x5420 __READ_WRITE
__BITS_CAN_MCR CAN_MCR_bit;

/* CAN master status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char INAK        : 1;
  unsigned char SLAK        : 1;
  unsigned char ERRI        : 1;
  unsigned char WKUI        : 1;
  unsigned char TX          : 1;
  unsigned char RX          : 1;
} __BITS_CAN_MSR;
#endif
//__IO_REG8_BIT(CAN_MSR,     0x5421, __READ_WRITE, __BITS_CAN_MSR);
unsigned char CAN_MSR; //0x5421 __READ_WRITE
__BITS_CAN_MSR CAN_MSR_bit;

/* CAN transmit status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RQCP0       : 1;
  unsigned char RQCP1       : 1;
  unsigned char RQCP2       : 1;
  unsigned char             : 1;
  unsigned char TXQOK0      : 1;
  unsigned char TXQOK1      : 1;
  unsigned char TXQOK2      : 1;
} __BITS_CAN_TSR;
#endif
//__IO_REG8_BIT(CAN_TSR,     0x5422, __READ_WRITE, __BITS_CAN_TSR);
unsigned char CAN_TSR; //0x5422 __READ_WRITE
__BITS_CAN_TSR CAN_TSR_bit;

/* CAN transmit priority register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CODE0       : 1;
  unsigned char CODE1       : 1;
  unsigned char TME0        : 1;
  unsigned char TME1        : 1;
  unsigned char TME2        : 1;
  unsigned char LOW0        : 1;
  unsigned char LOW1        : 1;
  unsigned char LOW2        : 1;
} __BITS_CAN_TPR;
#endif
//__IO_REG8_BIT(CAN_TPR,     0x5423, __READ, __BITS_CAN_TPR);
unsigned char CAN_TPR; //0x5423 __READ
__BITS_CAN_TPR CAN_TPR_bit;

/* CAN receive FIFO register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char FMP         : 2;
  unsigned char             : 1;
  unsigned char FULL        : 1;
  unsigned char FOVR        : 1;
  unsigned char RFOM        : 1;
} __BITS_CAN_RFR;
#endif
//__IO_REG8_BIT(CAN_RFR,     0x5424, __READ_WRITE, __BITS_CAN_RFR);
unsigned char CAN_RFR; //0x5424 __READ_WRITE
__BITS_CAN_RFR CAN_RFR_bit;

/* CAN interrupt enable register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TMEIE       : 1;
  unsigned char FMPIE       : 1;
  unsigned char FFIE        : 1;
  unsigned char             : 1;
  unsigned char FOVIE       : 1;
  unsigned char             : 2;
  unsigned char WKUIE       : 1;
} __BITS_CAN_IER;
#endif
//__IO_REG8_BIT(CAN_IER,     0x5425, __READ_WRITE, __BITS_CAN_IER);
unsigned char CAN_IER; //0x5425 __READ_WRITE
__BITS_CAN_IER CAN_IER_bit;

/* CAN diagnosis register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LBKM        : 1;
  unsigned char SILM        : 1;
  unsigned char SAMP        : 1;
  unsigned char RX          : 1;
  unsigned char TXM2E       : 1;
} __BITS_CAN_DGR;
#endif
//__IO_REG8_BIT(CAN_DGR,     0x5426, __READ_WRITE, __BITS_CAN_DGR);
unsigned char CAN_DGR; //0x5426 __READ_WRITE
__BITS_CAN_DGR CAN_DGR_bit;

/* CAN page selection register */
//__IO_REG8    (CAN_FPSR,    0x5427, __READ_WRITE);
unsigned char CAN_FPSR; //0x5427 __READ_WRITE
/* CAN Error Status Register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EWGF        : 1;
  unsigned char EPVF        : 1;
  unsigned char BOFF        : 1;
  unsigned char             : 1;
  unsigned char LEC0        : 1;
  unsigned char LEC1        : 1;
  unsigned char LEC2        : 1;
} __BITS_CAN_ESR;
#endif
//__IO_REG8_BIT(CAN_ESR,     0x5428, __READ_WRITE, __BITS_CAN_ESR);
unsigned char CAN_ESR; //0x5428 __READ_WRITE
__BITS_CAN_ESR CAN_ESR_bit;

/* CAN Error Interrupt Enable Register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EWGIE       : 1;
  unsigned char EPVIE       : 1;
  unsigned char BOFIE       : 1;
  unsigned char             : 1;
  unsigned char LECIE       : 1;
  unsigned char             : 2;
  unsigned char ERRIE       : 1;
} __BITS_CAN_EIER;
#endif
//__IO_REG8_BIT(CAN_EIER,    0x5429, __READ_WRITE, __BITS_CAN_EIER);
unsigned char CAN_EIER; //0x5429 __READ_WRITE
__BITS_CAN_EIER CAN_EIER_bit;

/* CAN paged register 0 */
//__IO_REG8    (CAN_P0,      0x5428, __READ_WRITE);
unsigned char CAN_P0; //0x5428 __READ_WRITE
/* CAN paged register 1 */
//__IO_REG8    (CAN_P1,      0x5429, __READ_WRITE);
unsigned char CAN_P1; //0x5429 __READ_WRITE
/* CAN paged register 2 */
//__IO_REG8    (CAN_P2,      0x542A, __READ_WRITE);
unsigned char CAN_P2; //0x542A __READ_WRITE
/* CAN paged register 3 */
//__IO_REG8    (CAN_P3,      0x542B, __READ_WRITE);
unsigned char CAN_P3; //0x542B __READ_WRITE
/* CAN paged register 4 */
//__IO_REG8    (CAN_P4,      0x542C, __READ_WRITE);
unsigned char CAN_P4; //0x542C __READ_WRITE
/* CAN paged register 5 */
//__IO_REG8    (CAN_P5,      0x542D, __READ_WRITE);
unsigned char CAN_P5; //0x542D __READ_WRITE
/* CAN paged register 6 */
//__IO_REG8    (CAN_P6,      0x542E, __READ_WRITE);
unsigned char CAN_P6; //0x542E __READ_WRITE
/* CAN paged register 7 */
//__IO_REG8    (CAN_P7,      0x542F, __READ_WRITE);
unsigned char CAN_P7; //0x542F __READ_WRITE
/* CAN paged register 8 */
//__IO_REG8    (CAN_P8,      0x5430, __READ_WRITE);
unsigned char CAN_P8; //0x5430 __READ_WRITE
/* CAN paged register 9 */
//__IO_REG8    (CAN_P9,      0x5431, __READ_WRITE);
unsigned char CAN_P9; //0x5431 __READ_WRITE
/* CAN paged register A */
//__IO_REG8    (CAN_PA,      0x5432, __READ_WRITE);
unsigned char CAN_PA; //0x5432 __READ_WRITE
/* CAN paged register B */
//__IO_REG8    (CAN_PB,      0x5433, __READ_WRITE);
unsigned char CAN_PB; //0x5433 __READ_WRITE
/* CAN paged register C */
//__IO_REG8    (CAN_PC,      0x5434, __READ_WRITE);
unsigned char CAN_PC; //0x5434 __READ_WRITE
/* CAN paged register D */
//__IO_REG8    (CAN_PD,      0x5435, __READ_WRITE);
unsigned char CAN_PD; //0x5435 __READ_WRITE
/* CAN paged register E */
//__IO_REG8    (CAN_PE,      0x5436, __READ_WRITE);
unsigned char CAN_PE; //0x5436 __READ_WRITE
/* CAN paged register F */
//__IO_REG8    (CAN_PF,      0x5437, __READ_WRITE);
unsigned char CAN_PF; //0x5437 __READ_WRITE

/*-------------------------------------------------------------------------
 *      beCAN bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

