morozanime/stm8_4_eclipse/iostm8s208mb.h
/* Global configuration register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SWO         : 1;
  unsigned char AL          : 1;
} __BITS_CPU_CFG_GCR;
#endif
//__IO_REG8_BIT(CPU_CFG_GCR, 0x7F60, __READ_WRITE, __BITS_CPU_CFG_GCR);
unsigned char CPU_CFG_GCR; //0x7F60 __READ_WRITE
__BITS_CPU_CFG_GCR CPU_CFG_GCR_bit;


/*-------------------------------------------------------------------------
 *      CPU bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define CPU_CCR_C                CPU_CCR_bit.C
#define CPU_CCR_Z                CPU_CCR_bit.Z
#define CPU_CCR_NF               CPU_CCR_bit.NF
#define CPU_CCR_I0               CPU_CCR_bit.I0
#define CPU_CCR_H                CPU_CCR_bit.H
#define CPU_CCR_I1               CPU_CCR_bit.I1
#define CPU_CCR_V                CPU_CCR_bit.V

#define CPU_CFG_GCR_SWO          CPU_CFG_GCR_bit.SWO
#define CPU_CFG_GCR_AL           CPU_CFG_GCR_bit.AL

#endif

/*-------------------------------------------------------------------------
 *      CPU bit masks
 *-----------------------------------------------------------------------*/
#define MASK_CPU_CCR_C           0x01
#define MASK_CPU_CCR_Z           0x02
#define MASK_CPU_CCR_NF          0x04
#define MASK_CPU_CCR_I0          0x08
#define MASK_CPU_CCR_H           0x10
#define MASK_CPU_CCR_I1          0x20
#define MASK_CPU_CCR_V           0x80

#define MASK_CPU_CFG_GCR_SWO     0x01
#define MASK_CPU_CFG_GCR_AL      0x02


/*-------------------------------------------------------------------------
 *      SWIM register definitions
 *-----------------------------------------------------------------------*/
/* SWIM control status register */
//__IO_REG8    (SWIM_CSR,    0x7F80, __READ_WRITE);
unsigned char SWIM_CSR; //0x7F80 __READ_WRITE


/*-------------------------------------------------------------------------
 *      DM register definitions
 *-----------------------------------------------------------------------*/
/* DM breakpoint 1 register extended byte */
//__IO_REG8    (DM_BK1RE,    0x7F90, __READ_WRITE);
unsigned char DM_BK1RE; //0x7F90 __READ_WRITE
/* DM breakpoint 1 register high byte */
//__IO_REG8    (DM_BK1RH,    0x7F91, __READ_WRITE);
unsigned char DM_BK1RH; //0x7F91 __READ_WRITE
/* DM breakpoint 1 register low byte */
//__IO_REG8    (DM_BK1RL,    0x7F92, __READ_WRITE);
unsigned char DM_BK1RL; //0x7F92 __READ_WRITE
/* DM breakpoint 2 register extended byte */
//__IO_REG8    (DM_BK2RE,    0x7F93, __READ_WRITE);
unsigned char DM_BK2RE; //0x7F93 __READ_WRITE
/* DM breakpoint 2 register high byte */
//__IO_REG8    (DM_BK2RH,    0x7F94, __READ_WRITE);
unsigned char DM_BK2RH; //0x7F94 __READ_WRITE
/* DM breakpoint 2 register low byte */
//__IO_REG8    (DM_BK2RL,    0x7F95, __READ_WRITE);
unsigned char DM_BK2RL; //0x7F95 __READ_WRITE
/* DM debug module control register 1 */
//__IO_REG8    (DM_CR1,      0x7F96, __READ_WRITE);
unsigned char DM_CR1; //0x7F96 __READ_WRITE
/* DM debug module control register 2 */
//__IO_REG8    (DM_CR2,      0x7F97, __READ_WRITE);
unsigned char DM_CR2; //0x7F97 __READ_WRITE
/* DM debug module control/status register 1 */
//__IO_REG8    (DM_CSR1,     0x7F98, __READ_WRITE);
unsigned char DM_CSR1; //0x7F98 __READ_WRITE
/* DM debug module control/status register 2 */
//__IO_REG8    (DM_CSR2,     0x7F99, __READ_WRITE);
unsigned char DM_CSR2; //0x7F99 __READ_WRITE
/* DM enable function register */
//__IO_REG8    (DM_ENFCTR,   0x7F9A, __READ_WRITE);
unsigned char DM_ENFCTR; //0x7F9A __READ_WRITE


/*-------------------------------------------------------------------------
 *      Interrupt vector numbers
 *-----------------------------------------------------------------------*/
#define AWU_vector                           0x03
#define CLK_CSS_vector                       0x04
#define CLK_SWITCH_vector                    0x04
#define beCAN_FMP_vector                     0x0A
#define beCAN_FULL_vector                    0x0A
#define beCAN_FOVR_vector                    0x0A
#define beCAN_EWGF_vector                    0x0B
#define beCAN_EPVF_vector                    0x0B
#define beCAN_BOFF_vector                    0x0B
#define beCAN_LEC0_vector                    0x0B
#define beCAN_LEC1_vector                    0x0B
#define beCAN_LEC2_vector                    0x0B
#define beCAN_RQCP0_vector                   0x0B
#define beCAN_RQCP1_vector                   0x0B
#define beCAN_RQCP2_vector                   0x0B
#define beCAN_WKUI_vector                    0x0B
#define SPI_TXE_vector                       0x0C
#define SPI_RXNE_vector                      0x0C
#define SPI_WKUP_vector                      0x0C
#define SPI_MODF_vector                      0x0C
#define SPI_OVR_vector                       0x0C
#define SPI_CRCERR_vector                    0x0C
#define TIM1_OVR_UIF_vector                  0x0D
#define TIM1_CAPCOM_BIF_vector               0x0D
#define TIM1_CAPCOM_TIF_vector               0x0D
#define TIM1_CAPCOM_CC1IF_vector             0x0E
#define TIM1_CAPCOM_CC2IF_vector             0x0E
#define TIM1_CAPCOM_CC3IF_vector             0x0E
#define TIM1_CAPCOM_CC4IF_vector             0x0E
#define TIM1_CAPCOM_COMIF_vector             0x0E
#define TIM2_OVR_UIF_vector                  0x0F
#define TIM2_CAPCOM_TIF_vector               0x10
#define TIM2_CAPCOM_CC1IF_vector             0x10
#define TIM2_CAPCOM_CC2IF_vector             0x10
#define TIM2_CAPCOM_CC3IF_vector             0x10
#define TIM3_OVR_UIF_vector                  0x11
#define TIM3_CAPCOM_TIF_vector               0x12
#define TIM3_CAPCOM_CC1IF_vector             0x12
#define TIM3_CAPCOM_CC2IF_vector             0x12
#define TIM3_CAPCOM_CC3IF_vector             0x12
#define UART1_T_TXE_vector                   0x13
#define UART1_T_TC_vector                    0x13
#define UART1_R_RXNE_vector                  0x14
#define UART1_R_OR_vector                    0x14
#define UART1_R_IDLE_vector                  0x14
#define UART1_R_PE_vector                    0x14
#define UART1_R_LBDF_vector                  0x14
#define I2C_SB_vector                        0x15
#define I2C_ADDR_vector                      0x15
#define I2C_ADD10_vector                     0x15
#define I2C_STOPF_vector                     0x15
#define I2C_BTF_vector                       0x15
#define I2C_WUFH_vector                      0x15
#define I2C_RXNE_vector                      0x15
#define I2C_TXE_vector                       0x15
#define I2C_BERR_vector                      0x15
#define I2C_ARLO_vector                      0x15
#define I2C_AF_vector                        0x15
#define I2C_OVR_vector                       0x15
#define UART3_T_TXE_vector                   0x16
#define UART3_T_TC_vector                    0x16
#define UART3_R_RXNE_vector                  0x17
#define UART3_R_OR_vector                    0x17
#define UART3_R_IDLE_vector                  0x17
#define UART3_R_PE_vector                    0x17
#define UART3_R_LBDF_vector                  0x17
#define UART3_R_LHDF_vector                  0x17
#define ADC2_AWDG_vector                     0x18
#define ADC2_EOC_vector                      0x18
#define TIM4_OVR_UIF_vector                  0x19
#define FLASH_EOP_vector                     0x1A
#define FLASH_WR_PG_DIS_vector               0x1A

#ifdef __IAR_SYSTEMS_ICC__
#pragma language=restore
#endif

#endif    /* __IOSTM8S208MB_H__ */

/*----------------------------------------------
 *      End of file
 *--------------------------------------------*/
